Reports/бит_ОтчетПросроченнаяЗадолженностьПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ОтчетПросроченнаяЗадолженностьПоЛицевымСчетам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_НачислениеЛьготПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеЛьготПоЛицевымСчетам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачислениеПоЛьготам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛьгот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоНосителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоСемейной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛичной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСумм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/бит_ОтчетПросроченнаяЗадолженностьПоЛицевымСчетам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает структуру внешних наборов данных отчета.
Функция ПолучитьВнешниеНаборыДанных(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	ПросроченнаяЗадолженность = ПолучитьПросроченнуюЗадолженность(ПараметрыОтчета, ПараметрыОтчета.Период);
	
	ВнешниеНаборыДанных = Новый Структура("ПросроченнаяЗадолженность", ПросроченнаяЗадолженность);
	
	Возврат ВнешниеНаборыДанных;
	
КонецФункции

// Возвращает структуру исполнения отчета.
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьВнешниеНаборыДанных,
	|ИспользоватьПередКомпоновкойМакета,
	|ИспользоватьПослеВыводаРезультата,
	|ИспользоватьДанныеРасшифровки",
	Истина, Истина, Истина, Истина);
	
КонецФункции

// Получает текст заголовка.
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат "Просроченная Задолженность по лицевым счетам на " + Формат(ПараметрыОтчета.Период, "ДФ=dd.MM.yyyy; ДП=...");
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет.
// Изменения сохранены не будут.
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Период"     , КонецДня(ПараметрыОтчета.Период) + 1);
	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаДолга"  , КонецДня(ПолучитьДатуДолга(ПараметрыОтчета.Организация, ПараметрыОтчета.Период)));
	
	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", ПолучитьДатуНачалоВеденияУчета(ПараметрыОтчета.Период, ПараметрыОтчета.Организация));
	
	бит_ОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
КонецПроцедуры

// Обрабатывает результат отчета.
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	бит_ОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
КонецПроцедуры

// Процедура используется подсистемой варианты отчетов.
//
Процедура НастройкиОтчета(Настройки) Экспорт
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Для Каждого Вариант Из Схема.ВариантыНастроек Цикл
		Настройки.ОписаниеВариантов.Вставить(Вариант.Имя,Вариант.Представление);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти	
	
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПросроченнуюЗадолженность(ПараметрыОтчета, КонДата)
	
	НачалоПериода = ПолучитьДатуНачалоВеденияУчета(КонДата, ПараметрыОтчета.Организация);
	ДатаДолга     = ПолучитьДатуДолга(ПараметрыОтчета.Организация, КонДата);
	
	НаборДанных = Новый ТаблицаЗначений;
	НаборДанных.Колонки.Добавить("Период"                      , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	НаборДанных.Колонки.Добавить("ЛицевойСчет"                 , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	НаборДанных.Колонки.Добавить("Услуга"                      , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	НаборДанных.Колонки.Добавить("Организация"                 , Новый ОписаниеТипов("СправочникСсылка.Организации"));
	НаборДанных.Колонки.Добавить("ПросроченнаяЗадолженность"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("Переплата"                   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("Оплата"                      , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("Разовые"                     , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("Начисления"                  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("КоличествоМесяцевЗадолжности", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	НаборДанных.Колонки.Добавить("КоличествоМесяцевПереплаты"  , ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	НаборДанных.Колонки.Добавить("Улица"                       , Новый ОписаниеТипов("СправочникСсылка.бит_СписокУлиц"));
	НаборДанных.Колонки.Добавить("Здание"                      , Новый ОписаниеТипов("СправочникСсылка.бит_СписокЗданий"));
	НаборДанных.Колонки.Добавить("ПочтовыйАдресЗдания"         , ОбщегоНазначения.ОписаниеТипаСтрока(150));
	НаборДанных.Колонки.Добавить("Квартира"                    , Новый ОписаниеТипов("СправочникСсылка.бит_Квартиры"));
	
	НаборДанных.Колонки.Добавить("ИтогПросроченнаяЗадолженностьСПени"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("ИтогПросроченнаяЗадолженностьСУчетомПереплатыСПени"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	НаборДанных.Колонки.Добавить("ОстатокПениНаКонецМесяца"   , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));


	Если КонДата < НачалоПериода Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильно указана дата начала ведения учета.");
		Возврат НаборДанных;
		
	КонецЕсли;
	
	// Инициализация СКД.
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных  = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных .Имя                = "ИсточникДанных";
	ИсточникДанных .ТипИсточникаДанных = "Local";
	
	НаборДанныхСКД = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанныхСКД.Имя = "НаборДанных";
	НаборДанныхСКД.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанныхСКД.Запрос = СформироватьЗапрос();
	НаборДанныхСКД.АвтоЗаполнениеДоступныхПолей = Истина;
	
	НаборДанныхСКД.Поля.Очистить();
	СхемаКомпоновкиДанных.ПоляИтога.Очистить();
	
	ГруппировкаКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	ГруппировкаКомпоновки.Выбор.Элементы.Очистить();
	
	АвтоПоле = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПоле.Использование = Истина;
	
	// Подготовка компоновщика макета компоновки данных.
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.Настройки.Отбор.Элементы.Очистить();
	
	бит_ОтчетыКлиентСервер.УстановитьПараметр(Компоновщик, "ДатаДолга"    , ДатаДолга);
	бит_ОтчетыКлиентСервер.УстановитьПараметр(Компоновщик, "НачалоПериода", НачалоПериода);
	бит_ОтчетыКлиентСервер.УстановитьПараметр(Компоновщик, "КонецПериода" , Новый Граница(КонецДня(КонДата), ВидГраницы.Включая));
	бит_ОтчетыКлиентСервер.УстановитьПараметр(Компоновщик, "Организация"  , ПараметрыОтчета.Организация, Истина);
	
	ДоступныеПоля = Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы;
	
	Для каждого ПолеВыбора Из ДоступныеПоля Цикл
		
		Если НЕ ПолеВыбора.Папка Тогда
			ВыбранноеПоле = Компоновщик.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ПолеВыбора.Поле;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ПараметрыОтчета.НастройкиКомпоновкиДанных <> Неопределено Тогда
		бит_ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, ПараметрыОтчета.НастройкиКомпоновкиДанных.Отбор, Истина);
	КонецЕсли;
	
	бит_ОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, Компоновщик);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// ВЫПОЛНЕНИЕ ЗАПРОСА.
	
	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Период УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Долг)
	|ПО
	|	ЛицевойСчет,
	|	Услуга";
	
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	запросПени = новый Запрос;
	запросПени.Текст = "
	| ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.Период КАК Период,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток КАК ИтогоПениНаНачалоМесяца,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток КАК ИтогоПениНаКонецМесяца
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|;";
	
	запросПени.УстановитьПараметр("НачалоПериода", КонДата);
	запросПени.УстановитьПараметр("КонецПериода", КонДата);
	табПени = запросПени.Выполнить().Выгрузить();
//	табПени.Свернуть("Период, ЛицевойСчет", "ИтогоПениНаКонецМесяца");
//	табПени.Сортировать("Период Убыв, ЛицевойСчет");
    новТабПни = табПени.Скопировать();
	новТабПни.Свернуть("Период, ЛицевойСчет", "ИтогоПениНаКонецМесяца"); 
	
	
	РезультатЗапроса = Запрос.Выполнить();
	табРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ВыборкаЛС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ВыборкаУС = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУС.Следующий() Цикл
			
			Выборка = ВыборкаУС.Выбрать();
			
			Долг                   = 0;
			ПоследующаяОплата      = 0;
			ПоследующиеПерерасчеты = 0;
			ПоследняяДата     = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Неопределено;
				
				Если Выборка.Период >= ДатаДолга Тогда
					ПоследующаяОплата      = ПоследующаяОплата + Выборка.Оплата;
					ПоследующиеПерерасчеты = ПоследующиеПерерасчеты + Выборка.Разовые;
				// БИТ_ЖКХ 03.06.2016 11:15:22 Начало правки... 	
				Иначе
					ПоследующаяОплата      = 0;
					ПоследующиеПерерасчеты = 0;
				// БИТ_ЖКХ 03.06.2016 11:15:25 Конец правки. 	
				КонецЕсли; 
				
				если Выборка.ИтогоПениНаКонецМесяца > 0 тогда
					ИтогоПениНаКонецМесяца      = Выборка.ИтогоПениНаКонецМесяца;
				конецесли;	
				
				Если Выборка.Период > ДатаДолга Тогда
					Продолжить;
				КонецЕсли; 
				
				Долг = ?(Долг = 0, Выборка.Долг + ПоследующиеПерерасчеты - ПоследующаяОплата, Долг);
				
				Если Долг > 0 Тогда
					
					Если Выборка.Период = ДатаДолга Тогда
						Продолжить;
					КонецЕсли; 
					
					ПросроченнаяЗадолженность = Выборка.Начисления + Выборка.Разовые;
					ПросроченнаяЗадолженность = ?(ПросроченнаяЗадолженность < 0,0,ПросроченнаяЗадолженность);
					
					ПросроченнаяЗадолженность = Мин(ПросроченнаяЗадолженность,Долг);
					
					Если НЕ ПросроченнаяЗадолженность = 0 Тогда
						НоваяСтрока = НаборДанных.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						НоваяСтрока.Организация                  = ПараметрыОтчета.Организация;
						НоваяСтрока.КоличествоМесяцевЗадолжности = Выборка.КоличествоМесяцев;
						
						НоваяСтрока.ПросроченнаяЗадолженность = ПросроченнаяЗадолженность;
						
						                       
                        						
						Долг = Долг - ПросроченнаяЗадолженность;
					КонецЕсли;
					
					Если Долг <= 0 Тогда
						Прервать;
					КонецЕсли;
					
				Иначе
					
					Если Выборка.Период = ДатаДолга Тогда
						Продолжить;
					КонецЕсли;
					
					Переплата = Выборка.Оплата * -1 + ?(Выборка.Разовые < 0,Выборка.Разовые,0) + ?(Выборка.Начисления < 0,Выборка.Начисления,0);
					Переплата = ?(Переплата > 0,0,Переплата);
					
					Переплата = Макс(Переплата,Долг);
					
					Если НЕ Переплата = 0 Тогда
						НоваяСтрока = НаборДанных.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						НоваяСтрока.Организация                  = ПараметрыОтчета.Организация;
						НоваяСтрока.КоличествоМесяцевЗадолжности = 0;
						НоваяСтрока.КоличествоМесяцевПереплаты   = Выборка.КоличествоМесяцев;
						
						НоваяСтрока.Переплата = Переплата;
						Долг = Долг - Переплата;
					КонецЕсли;
					
					Если Долг >= 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Долг > 0 И НЕ НоваяСтрока = Неопределено Тогда
				НоваяСтрока.ПросроченнаяЗадолженность = НоваяСтрока.ПросроченнаяЗадолженность + Долг;				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	// БИТ ЖКХ 10.06.2020
	НаборДанныхЛС = НаборДанных.Скопировать();	
	НаборДанныхЛС.Свернуть("ЛицевойСчет");
	НаборДанныхЛС.Сортировать("ЛицевойСчет");
	списокЛС = НаборДанныхЛС.ВыгрузитьКолонку("ЛицевойСчет");
	
    новНаборДанных = НаборДанных.Скопировать();	
	новНаборДанных.Свернуть("Период, ЛицевойСчет", "ПросроченнаяЗадолженность, Переплата");
	новНаборДанных.Сортировать("Период");
	
	для каждого стр из списокЛС цикл
		
	  Отбор = Новый Структура;	  
      Отбор.Вставить("ЛицевойСчет", стр);
      	  
	  СтрокиПени = новТабПни.НайтиСтроки(Отбор);
	  ОстатокПениНаконецМесяца = 0;
	  
	  если СтрокиПени.Количество() > 0 тогда                            
		ОстатокПениНаконецМесяца = СтрокиПени[0].ИтогоПениНаКонецМесяца;
	  Конецесли;	  
	  
	   // БИТ ЖКХ 15.06.2020
	  попытка
	      СтрокиПениПоЛС = НаборДанных.НайтиСтроки(Отбор);
	      индекс = СтрокиПениПоЛС.Количество()-1;
		  
	      если СтрокиПениПоЛС.Количество() > 0 тогда 
			СтрокиПениПоЛС[индекс].ОстатокПениНаконецМесяца = ОстатокПениНаконецМесяца; 
			СтрокиПениПоЛС[индекс].ИтогПросроченнаяЗадолженностьСПени = ОстатокПениНаконецМесяца;
		  Конецесли; 
		
	      КопияТаб = новНаборДанных.Скопировать(Отбор, "ЛицевойСчет, ПросроченнаяЗадолженность, Переплата");
		  если СтрокиПениПоЛС.Количество() > 0 тогда 
			  КопияТаб.Свернуть("ЛицевойСчет", "ПросроченнаяЗадолженность, Переплата");
			  СтрокиПениПоЛС[индекс].ИтогПросроченнаяЗадолженностьСПени =
			     ОстатокПениНаконецМесяца + 
				  КопияТаб[0].ПросроченнаяЗадолженность;
			 	  
		 	  СтрокиПениПоЛС[индекс].ИтогПросроченнаяЗадолженностьСУчетомПереплатыСПени =
			     ОстатокПениНаконецМесяца + 
				  КопияТаб[0].ПросроченнаяЗадолженность + 
				    КопияТаб[0].Переплата;		  		
		  Конецесли; 
	  исключение
	  конецпопытки; 		 			
		
	конеццикла;	  	
	
	Возврат НаборДанных;
	
КонецФункции

// Функция формирует запрос.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция СформироватьЗапрос()
	
	Текст =
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет.Наименование КАК Наименование,
	|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК Долг,
	|	НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) КАК Период,
	|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет.Организация КАК Организация
	|ПОМЕСТИТЬ ОстаткиПоУслугам
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ) КАК бит_НачисленияПоУслугамЖКХОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.Период КАК Период,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток КАК ИтогоПениНаНачалоМесяца,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток КАК ИтогоПениНаКонецМесяца
	|ПОМЕСТИТЬ ОстаткиПени
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК Период,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Наименование КАК Наименование,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начисления,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Организация КАК Организация
	|ПОМЕСТИТЬ НачисленияКУ
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Регистратор, ) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Наименование,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиПоУслугам.ЛицевойСчет, НачисленияКУ.ЛицевойСчет) КАК ЛицевойСчет,
	|	ЕСТЬNULL(ОстаткиПоУслугам.Наименование, НачисленияКУ.Наименование) КАК Наименование,
	|	ЕСТЬNULL(ОстаткиПоУслугам.УслугаЖКХ, НачисленияКУ.Услуга) КАК Услуга,
	|	ЕСТЬNULL(ОстаткиПоУслугам.Долг, 0) КАК Долг,
	|	ЕСТЬNULL(ОстаткиПоУслугам.Период, НачисленияКУ.Период) КАК Период,
	|	ЕСТЬNULL(НачисленияКУ.Оплата, 0) КАК Оплата,
	|	ЕСТЬNULL(НачисленияКУ.Разовые, 0) КАК Разовые,
	|	ЕСТЬNULL(НачисленияКУ.Начисления, 0) КАК Начисления,
	|	ЕСТЬNULL(ОстаткиПоУслугам.Организация, НачисленияКУ.Организация) КАК Организация,
	|	РАЗНОСТЬДАТ(ЕСТЬNULL(ОстаткиПоУслугам.Период, НачисленияКУ.Период), &ДатаДолга, МЕСЯЦ) КАК КоличествоМесяцев,
	|	ЕСТЬNULL(ОстаткиПоУслугам.ЛицевойСчет.Здание, НачисленияКУ.ЛицевойСчет.Здание) КАК Здание,
	|	ЕСТЬNULL(ОстаткиПоУслугам.ЛицевойСчет.Здание.ПочтовыйАдрес, НачисленияКУ.ЛицевойСчет.Здание.ПочтовыйАдрес) КАК ПочтовыйАдресЗдания,
	|	ЕСТЬNULL(ОстаткиПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета, НачисленияКУ.ЛицевойСчет.УлицаЛицевогоСчета) КАК Улица,
	|	ЕСТЬNULL(ОстаткиПоУслугам.ЛицевойСчет.Квартира, НачисленияКУ.ЛицевойСчет.Квартира) КАК Квартира,
	|	ЕСТЬNULL(ОстаткиПени.ИтогоПениНаКонецМесяца, 0) КАК ИтогоПениНаКонецМесяца
	|ИЗ
	|	ОстаткиПоУслугам КАК ОстаткиПоУслугам
	|		ПОЛНОЕ СОЕДИНЕНИЕ НачисленияКУ КАК НачисленияКУ
	|		ПО ОстаткиПоУслугам.ЛицевойСчет = НачисленияКУ.ЛицевойСчет
	|			И ОстаткиПоУслугам.УслугаЖКХ = НачисленияКУ.Услуга
	|			И ОстаткиПоУслугам.Период = НачисленияКУ.Период
	|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПени КАК ОстаткиПени
	|		ПО ОстаткиПоУслугам.ЛицевойСчет = ОстаткиПени.ЛицевойСчет
	|			И ОстаткиПоУслугам.УслугаЖКХ = ОстаткиПени.УслугаЖКХ
	|			И ОстаткиПоУслугам.Период = ОстаткиПени.Период";
	
	Возврат Текст;
	
КонецФункции // ()

// Функция фозвращает дату долга.
//
// Параметры:
//  Организация  - СправочникСсылка - фильтр к запросу.
//
//  Дата         - Дата             - фильтр к запросу.
//
// Возвращаемое значение:
//   Дата   - текущая дата долга.
//
Функция ПолучитьДатуДолга(Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции // ()

// Функция получает дату начала ведения учета из настроек параметров ЖКХ.
//
// Параметры:
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьДатуНачалоВеденияУчета(Дата, Организация)
	
	СтруктураПараметров = Новый Структура("ДатаНачалаВеденияПоКУ", Дата("00010101"));
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, СтруктураПараметров);
	
	Возврат СтруктураПараметров.ДатаНачалаВеденияПоКУ;
	
КонецФункции // ()

#КонецОбласти	
	
#КонецЕсли
